### Ans - 1

In [1]:
import pandas as pd

In [2]:
sr1 = pd.Series([4,8,15,16,23,42])
sr1

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

### Ans - 2

In [3]:
lst = [12,3,5,4,2,3,6,7,512,23]
sr2 = pd.Series(lst)
sr2

0     12
1      3
2      5
3      4
4      2
5      3
6      6
7      7
8    512
9     23
dtype: int64

### Ans - 3

In [4]:
data = {'Name':['Alice','Bob','Claire'],'Age':[25,30,27],'Gender':['Female','Male','Female']}
data

{'Name': ['Alice', 'Bob', 'Claire'],
 'Age': [25, 30, 27],
 'Gender': ['Female', 'Male', 'Female']}

### Ans - 4

### DataFrame : 
#### Dataframe is a two dimentional array which contains index, rows and columns.
#### Indexes represents the rows of the dataframe.
#### Basically it is a clear representation of tabular data or sql table.
#### Elements of DataFrame can be added or dropped in an existing DataFrame.
#### DataFrame elements can have different data types or Heterogenous.

### Series : 
#### Series is a one dimentional array which contains a single column.
#### Series is just same as python list but in series it has indexes which represents the element of a series.
#### Elements of Series can not be changed once it created.
#### Series elements must be of the same datatype or Homogenous.

In [5]:
s1 = pd.Series(['h1','h2','h3','h4'])
s1

0    h1
1    h2
2    h3
3    h4
dtype: object

In [6]:
df = pd.DataFrame({'Roll_no':[1006,1001,1002,1003],'Name':['Lakshit','Himal','Jenish','Kuldeep']})
df

   Roll_no     Name
0     1006  Lakshit
1     1001    Himal
2     1002   Jenish
3     1003  Kuldeep

### Ans - 5

#### We use below given function in dataframe : 
#### 1. df.mean()
#### 2. df.median()
#### 3. df.describe()
#### 4. df.sort_values()
#### 5. df.sort_index()
#### 6. df.rank()

In [7]:
df.mean(numeric_only=True)

Roll_no    1003.0
dtype: float64

In [8]:
df.median(numeric_only=True)

Roll_no    1002.5
dtype: float64

In [9]:
df.describe()

           Roll_no
count     4.000000
mean   1003.000000
std       2.160247
min    1001.000000
25%    1001.750000
50%    1002.500000
75%    1003.750000
max    1006.000000

In [10]:
df.sort_values(['Roll_no'])

   Roll_no     Name
1     1001    Himal
2     1002   Jenish
3     1003  Kuldeep
0     1006  Lakshit

In [11]:
df.sort_index()

   Roll_no     Name
0     1006  Lakshit
1     1001    Himal
2     1002   Jenish
3     1003  Kuldeep

In [12]:
df.rank()

   Roll_no  Name
0      4.0   4.0
1      1.0   1.0
2      2.0   2.0
3      3.0   3.0

### Ans - 6

#### All pandas data structures are value-mutable (the values they contain can be altered) but not always size-mutable. The length of a Series cannot be changed, but, for example, columns can be inserted into a DataFrame. However, the vast majority of methods produce new objects and leave the input data untouched. In general we like to favor immutability where sensible.

### Ans - 7

In [13]:
s1 = pd.Series([1,2,3,4])
s2 = pd.Series([2,4,6,8])
s3 = s1 ** 3

dff = pd.DataFrame({'Num':s1,'Square':s2,'Cube':s3})
# dff = pd.DataFrame([s1,s2],index=['NUM','POW'])
dff

   Num  Square  Cube
0    1       2     1
1    2       4     8
2    3       6    27
3    4       8    64